import type { Level } from '../types/game';


//declare level options
export const levels: Level[] = [
    {
        id: 'island-1',
        index: 0,
        title: 'Atom Structure',
        objective: 'เข้าใจโครงสร้างของอะตอม เช่น โปรตอน นิวตรอน และอิเล็กตรอน',
        description: 'ยินดีต้อนรับ นักสำรวจ! ออกเดินทางสู่โลกใต้ระดับอะตอม ภารกิจแรกของคุณคือการระบุอนุภาคที่มีประจุไฟฟ้าในอะตอม',
        question: 'อนุภาคใดมีประจุไฟฟ้าเป็นบวก?',
        options: [
            'อิเล็กตรอน',
            'นิวตรอน',
            'โปรตอน',
            'โฟตอน'
        ],
        img: 'https://media.geeksforgeeks.org/wp-content/uploads/20220727120730/AtomicStructure.jpg',
        correctAnswer: 2,
    },
    {
        id: 'island-2',
        index: 1,
        title: 'เลขอะตอม',
        objective: 'เข้าใจความหมายของเลขอะตอมและการจำแนกธาตุ',
        description: 'ธาตุแต่ละชนิดถูกกำหนดด้วยจำนวนโปรตอนในนิวเคลียส คุณสามารถระบุชนิดของธาตุจากข้อมูลนี้ได้หรือไม่?',
        question: 'อะตอมที่มีโปรตอน 6 ตัว เป็นธาตุใด?',
        options: [
            'ออกซิเจน',
            'คาร์บอน',
            'ไนโตรเจน',
            'ไฮโดรเจน'
        ],
        img: 'https://l450v.alamy.com/450vde/2a49ap8/kohlenstoff-c-chemische-element-co2-schild-mit-der-ordnungszahl-chemie-6-element-des-periodensystems-periodensystem-der-elemente-mit-der-ordnungszahl-wir-2a49ap8.jpg',
        correctAnswer: 1,
    },
    {
        id: 'island-3',
        index: 2,
        title: 'Isotopes',
        objective: 'เข้าใจความหมายของไอโซโทปและความแตกต่างของจำนวนนิวตรอน',
        description: 'อะตอมของธาตุเดียวกันอาจมีมวลต่างกันได้ ซึ่งเราเรียกว่าไอโซโทป',
        question: 'ความแตกต่างหลักระหว่างคาร์บอน-12 และคาร์บอน-14 คืออะไร?',
        options: [
            'จำนวนโปรตอน',
            'จำนวนอิเล็กตรอน',
            'จำนวนนิวตรอน',
            'เลขอะตอม'
        ],
        correctAnswer: 2,
    },
    {
        id: 'island-4',
        index: 3,
        title: 'Electron Energy Levels',
        objective: 'เข้าใจการเปลี่ยนระดับพลังงานของอิเล็กตรอน',
        description: 'อิเล็กตรอนอยู่ในระดับพลังงานที่แน่นอน และสามารถย้ายระดับได้เมื่อดูดกลืนหรือปล่อยพลังงาน',
        question: 'จะเกิดอะไรขึ้นเมื่ออิเล็กตรอนดูดกลืนพลังงาน?',
        options: [
            'ย้ายไปยังระดับพลังงานที่ต่ำลง',
            'ย้ายไปยังระดับพลังงานที่สูงขึ้น',
            'หลุดออกจากอะตอม',
            'เปลี่ยนเป็นโปรตอน'
        ],
        correctAnswer: 1,
    },
    {
        id: 'island-5',
        index: 4,
        title: 'Energy Emission',
        objective: 'เข้าใจการเกิดแสงจากอะตอม',
        description: 'เมื่ออิเล็กตรอนตกกลับสู่ระดับพลังงานต่ำกว่า มันจะปล่อยพลังงานออกมาในรูปของแสง',
        question: 'แสง (โฟตอน) เกิดขึ้นในอะตอมได้อย่างไร?',
        options: [
            'อิเล็กตรอนย้ายไปยังระดับพลังงานที่สูงขึ้น',
            'โปรตอนดูดกลืนพลังงาน',
            'อิเล็กตรอนตกลงสู่ระดับพลังงานที่ต่ำกว่า',
            'อะตอมสองอะตอมชนกัน'
        ],
        img: 'https://f.ptcdn.info/201/051/000/oq1r0jkuc4HVj9CbiBu-o.jpg',
        correctAnswer: 2,

    },
    {
        id: 'island-6',
        index: 5,
        title: 'Atomic Mass',
        objective: '',
        description: '',
        question: 'โฟตอนของแสงสีแดงที่มีความยาวคลื่น 640 นาโนเมตร มีพลังงานเท่าใด',
        options: [
            '1.3 eV',
            '1.5 eV',
            '1.7 eV',
            '1.9 eV'
        ],
        correctAnswer: 3,
    },
    {
        id: 'island-7',
        index: 6,
        title: 'Ions',
        objective: 'เข้าใจความหมายของอะตอมที่มีประจุไฟฟ้า',
        description: 'เมื่ออะตอมสูญเสียหรือได้รับอิเล็กตรอน สมดุลของประจุจะเปลี่ยนไป',
        question: 'อะตอมที่มีประจุบวกหรือประจุลบเรียกว่าอะไร?',
        options: [
            'ไอโซโทป',
            'โมเลกุล',
            'ไอออน',
            'ธาตุ'
        ],
        img: 'https://f.ptcdn.info/201/051/000/oq1r0jkuc4HVj9CbiBu-o.jpg',
        correctAnswer: 2,
    },
    {
        id: 'island-8',
        index: 7,
        title: 'Valence Electrons',
        objective: 'เข้าใจตำแหน่งของอิเล็กตรอนเวเลนซ์',
        description: 'ปฏิกิริยาเคมีส่วนใหญ่เกิดขึ้นที่บริเวณรอบนอกของอะตอม',
        question: 'อิเล็กตรอนเวเลนซ์อยู่ที่ตำแหน่งใด?',
        options: [
            'ภายในนิวเคลียส',
            'ในชั้นพลังงานที่อยู่ชั้นในสุด',
            'ในชั้นพลังงานนอกสุด',
            'ลอยอยู่นอกอะตอม'
        ],
        correctAnswer: 2,
    },
    {
        id: 'island-9',
        index: 8,
        title: 'Radioactivity',
        objective: 'เข้าใจความไม่เสถียรของนิวเคลียส',
        description: 'นิวเคลียสที่ไม่เสถียรจะพยายามปรับตัวเองให้เสถียรโดยการปล่อยพลังงานหรืออนุภาคออกมา',
        question: 'กระบวนการที่นิวเคลียสไม่เสถียรปล่อยพลังงานออกมาเรียกว่าอะไร?',
        options: [
            'การสลายตัวกัมมันตรังสี',
            'การจับอิเล็กตรอน',
            'การเกิดไอออน',
            'นิวเคลียร์ฟิวชัน'
        ],
        correctAnswer: 0,
    },
    {
        id: 'island-10',
        index: 9,
        title: 'พฤติกรรมความรู้ความจำ',
        objective: 'เข้าใจการแตกตัวของนิวเคลียสและการปลดปล่อยพลังงาน',
        description: 'การแตกตัวของนิวเคลียสสามารถปลดปล่อยพลังงานมหาศาลออกมาได้',
        question: 'สิ่งใดเกิดขึ้นในกระบวนการนิวเคลียร์ฟิชชัน?',
        options: [
            'อะตอมสองอะตอมรวมกัน',
            'อะตอมสูญเสียอิเล็กตรอน',
            'นิวเคลียสแตกออกเป็นส่วนที่เล็กลง',
            'โปรตอนเปลี่ยนเป็นนิวตรอน'
        ],
        correctAnswer: 2,
    },
    {
        id: 'island-11',
        index: 10,
        title: 'พฤติกรรมความเข้าใจ',
        objective: 'ข้อใดเป็นเหตุผลในการนำทฤษฎีอะตอมของโบร์มาอธิบายสเปกตรัมเส้นสว่างของอะตอมไฮโดรเจน',
        description: 'การรวมตัวของนิวเคลียสสามารถปลดปล่อยพลังงานมหาศาลออกมาได้',
        question: 'ข้อใดต่อไปนี้ ไม่ใช่ แบบจำลองอะตอมของทอมสัน?',
        options: [
            'อิเล็กตรอนเปลี่ยนวงโคจรโดยปล่อยพลังงาน',
            'อะตอมของไฮโดรเจนรับหรือปล่อยพลังงานแบบแน่นอนวัดค่าได้',
            'อิเล็กตรอนเคลื่อนที่รอบนิวเคลียสได้โดยไม่แผ่คลื่นแม่เหล็กไฟฟ้า',
            'มีประจุบวกและอิเล็กตรอนรวมกันอยู่ที่กลางอะตอม'
        ],
        correctAnswer: 1,
    },
    {
        id: 'island-12',
        index: 11,
        title: 'พฤติกรรมความเข้าใจ',
        objective: 'พลังงานของโฟตอนที่มีความถี่',
        description: '',
        question: 'พลังงานของโฟตอนที่มีความถี่ 5 x 10^14 Hz มีค่าเท่าใด?',
        options: [
            '3.31 x 10^-19 J',
            '6.62 x 10^-19 J',
            '9.93 x 10^-19 J',
            '1.32 x 10^-18 J'
        ],
        correctAnswer: 0,
    },
    {
        id: 'island-13',
        index: 12,
        title: '',
        objective: 'เข้าใจโจทย์',
        description: '',
        question: 'อะตอมของไฮโดรเจนมีอิเล็กตรอนอยู่ในสถานะถูกกระตุ้น 𝑛 = 3 โดยมีพลังงาน E3 = -1.51 eV กลับสู้สถานะพื้น E1 = -13.6 eV จะปล่อยคลื่นแม่เหล็กไฟฟ้าที่มีความยาวคลื่นเท่าใด',
        options: [
            '202.8 nm',
            '102.8 nm',
            '502.6 nm',
            '1602.3 nm'
        ],
        correctAnswer: 1,
    },
    {
        id: 'island-14',
        index: 13,
        title: '',
        objective: 'เข้าใจโจทย์',
        description: '',
        question: 'ฉายแสงที่มีความยาวคลื่น 3 × 10-7เมตร ตกบนผิวโพแทสเซียมที่มีฟงกชันงาน 2.24 อิเล็กตรอนโวลตโฟโตอิเล็กตรอนที่หลุดออกมามีพลังงานจลนสูงสุดเทาใดในหนวยจูล (กําหนดใหh = 6.63 ×10-34 Js',
        options: [
            '3.00 x 10^-19 J',
            '6.62 x 10^-19 J',
            '9.93 x 10^-19 J',
            '1.32 x 10^-18 J'
        ],
        correctAnswer: 0,
    }
];