import type { Level } from '../types/game';


//declare level options
export const levels: Level[] = [
    {
        id: 'island-1',
        index: 0,
        title: 'Atom Structure',
        objective: 'เข้าใจโครงสร้างของอะตอม เช่น โปรตอน นิวตรอน และอิเล็กตรอน',
        description: 'ยินดีต้อนรับ นักสำรวจ! ออกเดินทางสู่โลกใต้ระดับอะตอม ภารกิจแรกของคุณคือการระบุอนุภาคที่มีประจุไฟฟ้าในอะตอม',
        question: 'อนุภาคใดมีประจุไฟฟ้าเป็นบวก?',
        options: [
            'อิเล็กตรอน',
            'นิวตรอน',
            'โปรตอน',
            'โฟตอน'
        ],
        img: 'https://media.geeksforgeeks.org/wp-content/uploads/20220727120730/AtomicStructure.jpg',
        correctAnswer: 2,
    },
    {
        id: 'island-2',
        index: 1,
        title: 'เลขอะตอม',
        objective: 'เข้าใจความหมายของเลขอะตอมและการจำแนกธาตุ',
        description: 'ธาตุแต่ละชนิดถูกกำหนดด้วยจำนวนโปรตอนในนิวเคลียส คุณสามารถระบุชนิดของธาตุจากข้อมูลนี้ได้หรือไม่?',
        question: 'อะตอมที่มีโปรตอน 6 ตัว เป็นธาตุใด?',
        options: [
            'ออกซิเจน',
            'คาร์บอน',
            'ไนโตรเจน',
            'ไฮโดรเจน'
        ],
        img: 'https://l450v.alamy.com/450vde/2a49ap8/kohlenstoff-c-chemische-element-co2-schild-mit-der-ordnungszahl-chemie-6-element-des-periodensystems-periodensystem-der-elemente-mit-der-ordnungszahl-wir-2a49ap8.jpg',
        correctAnswer: 1,
    },
    {
        id: 'island-3',
        index: 2,
        title: 'Wave Length',
        objective: 'เข้าใจเงื่อนไขการเกิดปรากฏการณ์โฟโตอิเล็กทริกจากความยาวคลื่นของแสงและฟังก์ชันงานของโลหะ',
        description: 'วิเคราะห์ว่าแสงที่มีพลังงานเพียงพอสามารถทำให้อิเล็กตรอนหลุดออกจากผิวโลหะได้หรือไม่ และคำนวณพลังงานจลน์ของโฟโตอิเล็กตรอน',
        question: 'แสงความยาวคลื่น 600 นาโนเมตร ตกกระทบผิวโพแทสเซียมที่มีฟังก์ชันงาน 2.3 อิเล็กตรอนโวลต์จะมีอิเล็กตรอนลุดออกมาหรือไม่ ถ้ามี พลังงานของโฟโตอิเล็กตรอนเล่านี้มีค่าเท่าใด และถ้าไม่มีพลังงานที่ต้องเพิ่มมีค่าอย่างน้อยเท่าใด',
        options: ['0.23 eV', '0.44 eV', '1.23 eV', '2.3 eV'],
        correctAnswer: 0,
    },
    {
        id: 'island-4',
        index: 3,
        title: 'Electron Energy Levels',
        objective: 'เข้าใจการเปลี่ยนระดับพลังงานของอิเล็กตรอนภายในอะตอม',
        description: 'อธิบายผลที่เกิดขึ้นเมื่ออิเล็กตรอนดูดกลืนพลังงานและการเปลี่ยนแปลงระดับพลังงาน',
        question: 'จะเกิดอะไรขึ้นเมื่ออิเล็กตรอนดูดกลืนพลังงาน?',
        options: [
            'ย้ายไปยังระดับพลังงานที่ต่ำลง',
            'ย้ายไปยังระดับพลังงานที่สูงขึ้น',
            'หลุดออกจากอะตอม',
            'เปลี่ยนเป็นโปรตอน'
        ],
        correctAnswer: 1,
    },
    {
        id: 'island-5',
        index: 4,
        title: 'Energy Emission',
        objective: 'เข้าใจการเกิดแสงจากการเปลี่ยนระดับพลังงานของอิเล็กตรอน',
        description: 'อธิบายกระบวนการปล่อยพลังงานในรูปโฟตอนเมื่ออิเล็กตรอนกลับสู่ระดับพลังงานที่ต่ำกว่า',
        question: 'แสง (โฟตอน) เกิดขึ้นในอะตอมได้อย่างไร?',
        options: [
            'อิเล็กตรอนย้ายไปยังระดับพลังงานที่สูงขึ้น',
            'โปรตอนดูดกลืนพลังงาน',
            'อิเล็กตรอนตกลงสู่ระดับพลังงานที่ต่ำกว่า',
            'อะตอมสองอะตอมชนกัน'
        ],
        img: 'https://f.ptcdn.info/201/051/000/oq1r0jkuc4HVj9CbiBu-o.jpg',
        correctAnswer: 2,
    },
    {
        id: 'island-6',
        index: 5,
        title: 'Photon',
        objective: 'คำนวณพลังงานของโฟตอนจากความยาวคลื่นของแสง',
        description: 'ใช้สมการพลังงานโฟตอนเพื่อคำนวณพลังงานของแสงในหน่วยอิเล็กตรอนโวลต์',
        question: 'โฟตอนของแสงสีแดงที่มีความยาวคลื่น 640 นาโนเมตร มีพลังงานเท่าใด',
        options: ['1.3 eV', '1.5 eV', '1.7 eV', '1.9 eV'],
        correctAnswer: 3,
    },
    {
        id: 'island-7',
        index: 6,
        title: 'Photoelectric Effect',
        objective: 'เข้าใจความสัมพันธ์ระหว่างพลังงานจลน์สูงสุดของโฟโตอิเล็กตรอนกับความต่างศักย์ยับยั้ง',
        description: 'เชื่อมโยงการทดลองโฟโตอิเล็กทริกกับค่าพลังงานจลน์สูงสุดของอิเล็กตรอน',
        question: 'ในการทดลองปรากฏการณ์โฟโตอิเล็กทริก พบว่าความต่างศักย์ยับยั้งมีค่าเท่ากับ 3.7 โวลต์ พลังงานจลน์สูงสุดของโฟโตอิเล็กตรอนมีค่าเท่าใด',
        options: ['0.3 eV', '8.2 eV', '3.7 eV', '1.2 eV'],
        correctAnswer: 2,
    },
    {
        id: 'island-8',
        index: 7,
        title: 'Atomic Models',
        objective: 'แยกแยะคุณสมบัติของแบบจำลองอะตอมแต่ละแบบ',
        description: 'วิเคราะห์แนวคิดของแบบจำลองอะตอมและระบุข้อที่ไม่สอดคล้องกับแบบจำลองของทอมสัน',
        question: 'ข้อใดต่อไปนี้ ไม่ใช่ แบบจำลองอะตอมของทอมสัน?',
        options: [
            'อิเล็กตรอนเปลี่ยนวงโคจรโดยปล่อยพลังงาน',
            'อะตอมของไฮโดรเจนรับหรือปล่อยพลังงานแบบแน่นอนวัดค่าได้',
            'อิเล็กตรอนเคลื่อนที่รอบนิวเคลียสได้โดยไม่แผ่คลื่นแม่เหล็กไฟฟ้า',
            'มีประจุบวกและอิเล็กตรอนรวมกันอยู่ที่กลางอะตอม'
        ],
        correctAnswer: 0,
    },
    {
        id: 'island-9',
        index: 8,
        title: 'Photon Energy',
        objective: 'คำนวณพลังงานของโฟตอนจากความถี่',
        description: 'ใช้สมการ E = hf เพื่อคำนวณพลังงานของโฟตอนในหน่วยจูล',
        question: 'พลังงานของโฟตอนที่มีความถี่ 5 x 10^14 Hz มีค่าเท่าใด?',
        options: [
            '3.31 x 10^-19 J',
            '6.62 x 10^-19 J',
            '9.93 x 10^-19 J',
            '1.32 x 10^-18 J'
        ],
        correctAnswer: 0,
    },
    {
        id: 'island-10',
        index: 9,
        title: 'Hydrogen Spectrum',
        objective: 'คำนวณความยาวคลื่นของรังสีที่ปล่อยจากอะตอมไฮโดรเจน',
        description: 'วิเคราะห์การเปลี่ยนระดับพลังงานของอิเล็กตรอนในอะตอมไฮโดรเจน',
        question: 'อะตอมของไฮโดรเจนมีอิเล็กตรอนอยู่ในสถานะถูกกระตุ้น 𝑛 = 3 โดยมีพลังงาน E3 = -1.51 eV กลับสู้สถานะพื้น E1 = -13.6 eV จะปล่อยคลื่นแม่เหล็กไฟฟ้าที่มีความยาวคลื่นเท่าใด',
        options: ['202.8 nm', '102.8 nm', '502.6 nm', '1602.3 nm'],
        correctAnswer: 1,
    },
    {
        id: 'island-11',
        index: 10,
        title: 'Photoelectric Calculation',
        objective: 'คำนวณพลังงานจลน์สูงสุดของโฟโตอิเล็กตรอน',
        description: 'ประยุกต์สมการพลังงานโฟตอนและฟังก์ชันงาน',
        question: 'ฉายแสงที่มีความยาวคลื่น 3 × 10-7เมตร ตกบนผิวโพแทสเซียมที่มีฟังก์ชันงาน 2.24 อิเล็กตรอนโวลตโฟโตอิเล็กตรอนที่หลุดออกมามีพลังงานจลนสูงสุดเทาใดในหนวยจูล',
        options: [
            '3.00 x 10^-19 J',
            '6.62 x 10^-19 J',
            '9.93 x 10^-19 J',
            '1.32 x 10^-18 J'
        ],
        correctAnswer: 0,
    },
    {
        id: 'island-12',
        index: 11,
        title: 'de Broglie Wavelength',
        objective: 'คำนวณความยาวคลื่นเดอบรอยล์ของอนุภาค',
        description: 'เชื่อมโยงแนวคิดคลื่นของสสารกับมวลและความเร็วของอนุภาค',
        question: 'โปรตอนที่มีมวล 1.67 x 10^-27 กิโลกรัม และกำลังเคลื่อนที่ด้วยความเร็ว 5.00 x 10 ^ 7 เมตรต่อวินาที มีความยาวคลื่นเดอบรอยล์เท่าใด',
        options: [
            '1.22 x 10^-6 m',
            '7.94 x 10^-15 m',
            '1.52 x 10^-8 m',
            '1.92 x 10^-7 m'
        ],
        correctAnswer: 1,
    },
    {
        id: 'island-13',
        index: 12,
        title: 'Matter Wave',
        objective: 'ตระหนักถึงความเล็กมากของความยาวคลื่นเดอบรอยล์ในวัตถุขนาดใหญ่',
        description: 'เปรียบเทียบพฤติกรรมเชิงคลื่นของวัตถุขนาดใหญ่กับอนุภาคระดับอะตอม',
        question: 'รถแข่งที่มีมวล (รวมผู้ขับ) 650 กิโลกรัม ขณะก าลังเคลื่อนที่ด้วยอัตราเร็ว 300 กิโลเมตรต่อชั่วโมง มีความยาวคลื่นเดอบรอยล์เท่าใด',
        options: [
            '3.00 x 10^-19 m',
            '6.62 x 10^-19 m',
            '9.93 x 10^-22 m',
            '1.22 x 10^-38 m'
        ],
        correctAnswer: 3,
    }
];